{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-7-42960dfa0c00>\u00da\b<lambda>!\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "input_dtype": "float32", "arguments": {}, "function_type": "lambda", "name": "lambda_1", "output_shape": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "bias": true, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "nb_filter": 24, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_1", "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "bias": true, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_2", "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "bias": true, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_3", "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_4", "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_5", "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.7, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 100, "input_dim": 1152, "trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_1", "W_constraint": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 50, "input_dim": 100, "trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_2", "W_constraint": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 10, "input_dim": 50, "trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_3", "W_constraint": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 1, "input_dim": 10, "trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_4", "W_constraint": null, "b_regularizer": null, "W_regularizer": null}}]}