{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 40, 160, 3], "output_shape_type": "raw", "output_shape": null, "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-7-4c78b518e539>\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activation": "elu", "nb_filter": 3, "name": "Conv2D1", "nb_row": 1, "trainable": true, "W_regularizer": null, "b_constraint": null, "nb_col": 1, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activation": "elu", "nb_filter": 16, "name": "Conv2D2", "nb_row": 8, "trainable": true, "W_regularizer": null, "b_constraint": null, "nb_col": 8, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "MaxPoolC2", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "DropoutC2", "p": 0.3}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activation": "elu", "nb_filter": 32, "name": "Conv2D3", "nb_row": 5, "trainable": true, "W_regularizer": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "MaxPoolC3", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "DropoutC3", "p": 0.3}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activation": "elu", "nb_filter": 32, "name": "Conv2D4", "nb_row": 3, "trainable": true, "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "MaxPoolC4", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "DropoutC4", "p": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "Conv2Dense"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "output_dim": 256, "W_constraint": null, "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "name": "Dense1", "trainable": true, "activity_regularizer": null, "input_dim": 1088, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "DropoutD1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 128, "W_constraint": null, "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "name": "Dense2", "trainable": true, "activity_regularizer": null, "input_dim": 256, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "DropoutD2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 64, "W_constraint": null, "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "name": "Dense3", "trainable": true, "activity_regularizer": null, "input_dim": 128, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "DropoutD3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 8, "W_constraint": null, "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "name": "Dense4", "trainable": true, "activity_regularizer": null, "input_dim": 64, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "DropoutD4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "name": "Output", "trainable": true, "activity_regularizer": null, "input_dim": 8, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}