{"config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "name": "lambda_2", "trainable": true, "output_shape": null, "output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-e44a5f6e2381>\u00da\b<lambda>\u000e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "name": "convolution2d_6", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "activation": "relu", "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "name": "convolution2d_7", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "activation": "relu", "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "name": "convolution2d_8", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "activation": "relu", "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 3, "name": "convolution2d_9", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "activation": "relu", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 3, "name": "convolution2d_10", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "activation": "relu", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_filter": 64}}, {"class_name": "Dropout", "config": {"p": 0.7, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_5", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": 1152, "init": "glorot_uniform", "output_dim": 100, "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_6", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "output_dim": 50, "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_7", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "output_dim": 10, "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_8", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "output_dim": 1, "b_regularizer": null, "trainable": true}}], "class_name": "Sequential", "keras_version": "1.2.0"}